---
kind: type
id: T:Autodesk.Revit.UI.TabbedDialogAction
source: html/ae47d8b8-0dbb-307d-a34b-6a87cc35e372.htm
---
# Autodesk.Revit.UI.TabbedDialogAction

Delegate for tabbed dialog actions, such as OnOK, OnCancel and RestoreDefaults.

## Syntax (C#)
```csharp
public delegate void TabbedDialogAction()
```